app/controllers/hero_powers_controller.rb

INSERT INTO "hero_powers" ("strength", "power_id", "hero_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["strength", "Average"], ["power_id", 1], ["hero_id", 3], ["created_at", "2023-03-26 14:06:51.210045"], ["updated_at", "2023-03-26 14:06:51.210045"]]
---
    def create
        hero_power = HeroPower.create!(hero_power_params)