app/controllers/powers_controller.rb

    def index
        powers = Power.all
---
SELECT "hero_powers".* FROM "hero_powers" WHERE "hero_powers"."power_id" = ?  [["power_id", 1]]
SELECT "powers".* FROM "powers"

    def update
        power  = find_power
        power.update(power_params)
---
UPDATE "powers" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "powers"."id" = ?  [["name", "Infinity Stones"], ["description", "Eternals Skilled hand-to-hand combatant Plasma energy projection."], ["updated_at", "2023-03-26 13:10:13.698758"], ["id", 1]]

    def find_power
        Power.find(params[:id])
---
SELECT "hero_powers".* FROM "hero_powers" WHERE "hero_powers"."power_id" = ?  [["power_id", 1]]
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]